## <img height="35" src="https://raw.githubusercontent.com/alonnalgoDevSecOps/risk-analysis-action/main/algosec_logo.png" /><sup> &nbsp; Connectivity Risk Analysis &nbsp; <sub><sub><img height="22" src="https://raw.githubusercontent.com/alonnalgoDevSecOps/risk-analysis-action/main/icons/failure.png" /><sub><sub><sup><sup> 
<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

                 
</tbody>
</table>
<details open="true">
No Risks Found

## <sup>Terraform Processing &nbsp; <sub><sub><img height="22" src="https://raw.githubusercontent.com/alonnalgoDevSecOps/risk-analysis-action/main/icons/success.png" /><sub><sub><sup>

<details>
<summary>Terraform Log</summary>
<br>Output<br>
&nbsp;

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.AutoSecurityGroupSSHBase will be created
  + resource "aws_security_group" "AutoSecurityGroupSSHBase" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroup_SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh to anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.7.0/24",
                  + "10.9.0.0/16",
                  + "10.8.8.123/32",
                  + "10.8.8.156/32",
                  + "10.8.11.7/32",
                  + "31.154.25.138/32",
                ]
              + description      = "ssh incoming"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AutoSecurityGroup_SSH_test"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on test-tf.tf line 3, in provider "aws":
   3:   version    = "~> 2.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Quoted references are deprecated

  on test-tf.tf line 15, in resource "aws_security_group" "AutoSecurityGroupSSHBase":
  15:   provider    = "aws.east1"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_dddc7ac9-eadb-5a10-baba-78c27e0ff5fc/tf-test-2\tmp\tf-tf-test-2.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_dddc7ac9-eadb-5a10-baba-78c27e0ff5fc/tf-test-2\\tmp\\tf-tf-test-2.out"


```

Errors

```



```

</details> <!-- End Format Logs -->
</details>
<br>*Pusher: @suyashalgo, Action: `pull_request`, Working Directory: '/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example', Workflow: 'Customer Repo CI/CD'*